avrdudes/avr-libc/include/avr/ioavr32du20.h
/* Receiver Mode select bit group values */
typedef enum USART_RXMODE_VALUES_enum
{
    USART_RXMODE_NORMAL_gv         = 0x00,  /* Normal mode */
    USART_RXMODE_CLK2X_gv          = 0x01,  /* CLK2x mode */
    USART_RXMODE_GENAUTO_gv        = 0x02,  /* Generic autobaud mode */
    USART_RXMODE_LINAUTO_gv        = 0x03   /* LIN constrained autobaud mode */
} USART_RXMODE_values_t;

/* Receiver Mode select bit group configurations*/
typedef enum USART_RXMODE_enum
{
    USART_RXMODE_NORMAL_gc         = (USART_RXMODE_NORMAL_gv << USART_RXMODE_gp),  /* Normal mode */
    USART_RXMODE_CLK2X_gc          = (USART_RXMODE_CLK2X_gv << USART_RXMODE_gp),  /* CLK2x mode */
    USART_RXMODE_GENAUTO_gc        = (USART_RXMODE_GENAUTO_gv << USART_RXMODE_gp),  /* Generic autobaud mode */
    USART_RXMODE_LINAUTO_gc        = (USART_RXMODE_LINAUTO_gv << USART_RXMODE_gp)   /* LIN constrained autobaud mode */
} USART_RXMODE_t;

/* Stop Bit Mode select bit group values */
typedef enum USART_SBMODE_VALUES_enum
{
    USART_SBMODE_1BIT_gv           = 0x00,  /* 1 stop bit */
    USART_SBMODE_2BIT_gv           = 0x01   /* 2 stop bits */
} USART_SBMODE_values_t;

/* Stop Bit Mode select bit group configurations*/
typedef enum USART_SBMODE_enum
{
    USART_SBMODE_1BIT_gc           = (USART_SBMODE_1BIT_gv << USART_SBMODE_bp),  /* 1 stop bit */
    USART_SBMODE_2BIT_gc           = (USART_SBMODE_2BIT_gv << USART_SBMODE_bp)   /* 2 stop bits */
} USART_SBMODE_t;

/*
--------------------------------------------------------------------------
USB - USB Device Controller
--------------------------------------------------------------------------
*/

#define USB_MAX_ENDPOINTS  16

/* USB Device Controller EP */
typedef struct USB_EP_struct
{
    register8_t STATUS;  /* Endpoint Status */
    register8_t CTRL;  /* Endpoint Control */
    _WORDREGISTER(CNT);  /* Endpoint Byte Count */
    _WORDREGISTER(DATAPTR);  /* Endpoint Data Pointer */
    _WORDREGISTER(MCNT);  /* Endpoint Multi-packet Byte Count */
} USB_EP_t;

/* USB Device Controller EP_PAIR */
typedef struct USB_EP_PAIR_struct
{
    USB_EP_t OUT;  /* USB Device Controller OUT */
    USB_EP_t IN;  /* USB Device Controller IN */
} USB_EP_PAIR_t;

/* USB Device Controller EP_TABLE */
typedef struct USB_EP_TABLE_struct
{
    register8_t FIFO[32];  /* FIFO Pointer Table */
    USB_EP_PAIR_t EP[16];  /* USB Device Controller EP */
    _WORDREGISTER(FRAMENUM);  /* FRAMENUM count */
} USB_EP_TABLE_t;

/* USB Device Controller STATUS */
typedef struct USB_STATUS_struct
{
    register8_t OUTCLR;  /* Endpoint n OUT Status Clear */
    register8_t OUTSET;  /* Endpoint n OUT Status Set */
    register8_t INCLR;  /* Endpoint n IN Status Clear */
    register8_t INSET;  /* Endpoint n IN Status Set */
} USB_STATUS_t;

/* USB Device Controller */
typedef struct USB_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t BUSSTATE;  /* Bus State */
    register8_t ADDR;  /* Address */
    register8_t FIFOWP;  /* FIFO Write Pointer */
    register8_t FIFORP;  /* FIFO Read Pointer */
    _WORDREGISTER(EPPTR);  /* Endpoint Configuration Table Pointer */
    register8_t INTCTRLA;  /* Interrupt Control A */
    register8_t INTCTRLB;  /* Interrupt Control B */
    register8_t INTFLAGSA;  /* Interrupt Flags A */
    register8_t INTFLAGSB;  /* Interrupt Flags B */
    register8_t reserved_1[52];
    USB_STATUS_t STATUS[16];  /* USB Device Controller STATUS */
} USB_t;

/* Data Size default select bit group values */
typedef enum USB_BUFSIZE_DEFAULT_VALUES_enum
{
    USB_BUFSIZE_DEFAULT_BUF8_gv    = 0x00,  /* 8 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF16_gv   = 0x01,  /* 16 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF32_gv   = 0x02,  /* 32 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF64_gv   = 0x03   /* 64 bytes buffer size */
} USB_BUFSIZE_DEFAULT_values_t;

/* Data Size default select bit group configurations*/
typedef enum USB_BUFSIZE_DEFAULT_enum
{
    USB_BUFSIZE_DEFAULT_BUF8_gc    = (USB_BUFSIZE_DEFAULT_BUF8_gv << USB_BUFSIZE_DEFAULT_gp),  /* 8 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF16_gc   = (USB_BUFSIZE_DEFAULT_BUF16_gv << USB_BUFSIZE_DEFAULT_gp),  /* 16 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF32_gc   = (USB_BUFSIZE_DEFAULT_BUF32_gv << USB_BUFSIZE_DEFAULT_gp),  /* 32 bytes buffer size */
    USB_BUFSIZE_DEFAULT_BUF64_gc   = (USB_BUFSIZE_DEFAULT_BUF64_gv << USB_BUFSIZE_DEFAULT_gp)   /* 64 bytes buffer size */
} USB_BUFSIZE_DEFAULT_t;

/* Data Size isochronous select bit group values */
typedef enum USB_BUFSIZE_ISO_VALUES_enum
{
    USB_BUFSIZE_ISO_BUF8_gv        = 0x00,  /* 8 bytes buffer size */
    USB_BUFSIZE_ISO_BUF16_gv       = 0x01,  /* 16 bytes buffer size */
    USB_BUFSIZE_ISO_BUF32_gv       = 0x02,  /* 32 bytes buffer size */
    USB_BUFSIZE_ISO_BUF64_gv       = 0x03,  /* 64 bytes buffer size */
    USB_BUFSIZE_ISO_BUF128_gv      = 0x04,  /* 128 bytes buffer size */
    USB_BUFSIZE_ISO_BUF256_gv      = 0x05,  /* 256 bytes buffer size */
    USB_BUFSIZE_ISO_BUF512_gv      = 0x06,  /* 512 bytes buffer size */
    USB_BUFSIZE_ISO_BUF1023_gv     = 0x07   /* 1023 bytes buffer size */
} USB_BUFSIZE_ISO_values_t;

/* Data Size isochronous select bit group configurations*/
typedef enum USB_BUFSIZE_ISO_enum
{
    USB_BUFSIZE_ISO_BUF8_gc        = (USB_BUFSIZE_ISO_BUF8_gv << USB_BUFSIZE_ISO_gp),  /* 8 bytes buffer size */
    USB_BUFSIZE_ISO_BUF16_gc       = (USB_BUFSIZE_ISO_BUF16_gv << USB_BUFSIZE_ISO_gp),  /* 16 bytes buffer size */
    USB_BUFSIZE_ISO_BUF32_gc       = (USB_BUFSIZE_ISO_BUF32_gv << USB_BUFSIZE_ISO_gp),  /* 32 bytes buffer size */
    USB_BUFSIZE_ISO_BUF64_gc       = (USB_BUFSIZE_ISO_BUF64_gv << USB_BUFSIZE_ISO_gp),  /* 64 bytes buffer size */
    USB_BUFSIZE_ISO_BUF128_gc      = (USB_BUFSIZE_ISO_BUF128_gv << USB_BUFSIZE_ISO_gp),  /* 128 bytes buffer size */
    USB_BUFSIZE_ISO_BUF256_gc      = (USB_BUFSIZE_ISO_BUF256_gv << USB_BUFSIZE_ISO_gp),  /* 256 bytes buffer size */
    USB_BUFSIZE_ISO_BUF512_gc      = (USB_BUFSIZE_ISO_BUF512_gv << USB_BUFSIZE_ISO_gp),  /* 512 bytes buffer size */
    USB_BUFSIZE_ISO_BUF1023_gc     = (USB_BUFSIZE_ISO_BUF1023_gv << USB_BUFSIZE_ISO_gp)   /* 1023 bytes buffer size */
} USB_BUFSIZE_ISO_t;

/* Data Toggle select bit group values */
typedef enum USB_TOGGLE_VALUES_enum
{
    USB_TOGGLE_DATA0_gv            = 0x00,  /* DATA0 PID in next transaction */
    USB_TOGGLE_DATA1_gv            = 0x01   /* DATA1 PID in next transaction */
} USB_TOGGLE_values_t;

